import { CookiesContent } from "./cookies-types";

export const contentGr: CookiesContent = {
    pageTitle: 'Πολιτική cookies',
    introText: 'Αυτός ο ιστότοπος χρησιμοποιεί cookies για να σας προσφέρει την καλύτερη δυνατή εμπειρία χρήσης της εφαρμογής.',
    block: {
        title: 'Τι είναι τα cookies;',
        text: `
            Τα cookies είναι μικρά αρχεία κειμένου που αποθηκεύονται στον υπολογιστή ή την κινητή σας συσκευή όταν επισκέπτεστε έναν ιστότοπο.
            Χρησιμοποιούνται ευρέως για να λειτουργούν οι ιστοτόποι ή να λειτουργούν πιο αποτελεσματικά, καθώς και για να παρέχουν πληροφορίες 
            στους ιδιοκτήτες των ιστοτόπων.
        `
    },
    block2: {
        title: 'Γιατί χρησιμοποιούμε cookies;',
        text: 'Χρησιμοποιούμε cookies για τους ακόλουθους σκοπούς:'
    },
    list1: [
        {
            title: 'Απαραίτητα cookies',
            text: `
                Αυτά τα cookies είναι απαραίτητα για τη βασική λειτουργία του ιστοτόπου μας, όπως σας επιτρέπουν να αποθηκεύετε τα στοιχεία 
                της εταιρείας σας (τίτλος, υπότιτλος, τηλέφωνο, τοποθεσία, email) στον τοπικό αποθηκευτικό χώρο του προγράμματος περιήγησής σας για 
                ευκολότερη χρήση στο μέλλον.`
        },
        {
            title: 'Google Analytics 4 Cookies ',
            text: `
                Χρησιμοποιούμε το Google Analytics 4 για να συλλέξουμε ανώνυμες πληροφορίες σχετικά με τον τρόπο χρήσης του ιστοτόπου μας από τους επισκέπτες. 
                Αυτό μας βοηθά να κατανοήσουμε την επισκεψιμότητα του ιστοτόπου και να βελτιώσουμε την εμπειρία χρήστη.`
        },
        {
            title: 'Cookies τρίτων',
            text: 'Ενδέχεται να χρησιμοποιήσουμε cookies τρίτων για σκοπούς μάρκετινγκ, όπως η επαναστόχευση διαφημίσεων.'
        }
    ],
    cookiesLink: `
        Μπορείτε να βρείτε περισσότερες πληροφορίες σχετικά με τα cookies του Google Analytics 4
        <a class="link" href="https://support.google.com/analytics/answer/11397207?hl=en&sjid=12660115510274093596-EU" target="_blank">εδώ</a>.
    `,
    block3: {
        title: 'Έλεγχος cookies',
        text: `
            Μπορείτε να ελέγξετε ή/και να διαγράψετε τα cookies όπως θέλετε - για λεπτομέρειες, δείτε 
            <a class="link" href="https://www.aboutcookies.org/" target="_blank">aboutcookies.org</a>.
            Μπορείτε να διαγράψετε όλα τα cookies που βρίσκονται ήδη στον υπολογιστή σας και μπορείτε να ρυθμίσετε τα περισσότερα προγράμματα 
            περιήγησης για να αποτρέψετε την τοποθέτησή τους. Ωστόσο εάν το κάνετε αυτό, μπορεί να χρειαστεί να προσαρμόσετε χειροκίνητα ορισμένες 
            προτιμήσεις κάθε φορά που επισκέπτεστε έναν ιστότοπο και ορισμένες υπηρεσίες και λειτουργίες ενδέχεται να μην λειτουργούν.
        `
    },
    block4: {
        title: 'Αποποίηση ευθύνης',
        text: `
            Αυτός ο ιστότοπος περιέχει συνδέσμους προς άλλους ιστότοπους. Σας σημειώνουμε ότι δεν έχουμε κανένα έλεγχο over τον 
            τρόπο με τον οποίο αυτοί οι ιστοτόποι χρησιμοποιούν cookies και σας συμβουλεύουμε να ελέγξετε τις αντίστοιχες πολιτικές απορρήτου τους.
        `
    },
    buttonText: 'Επιστροφή στην αρχική'
};