import { AboutContent } from "./about-types";

export const contentGr: AboutContent = {
    pageHeader: 'Σχετικά με την Εφαρμογή',
    appDescription: `
        Αυτή η <strong><u>δωρεάν</u></strong> εφαρμογή, κατασκευασμένη με εργαλεία εφαρμογών τελευταίας τεχνολογίας, 
        απλοποιεί τη διαδικασία δημιουργίας και κοινοποίησης επαγγελματικών προσφορών προϊόντων, αξιοποιώντας σύγχρονες 
        τεχνολογίες ιστού για μια φιλική και αποδοτική εμπειρία χρήσης. Παρέχει στις επιχειρήσεις τη δυνατότητα να 
        δημιουργούν λεπτομερείς, επαγγελματικές προσφορές σε λίγα λεπτά, εξοικονομώντας χρόνο και διασφαλίζοντας 
        την ποιότητα σε κάθε έγγραφο.
    `,
    keyFeaturesHeader: 'Τα βασικά χαρακτηριστικά περιλαμβάνουν:',
    features: [
        {
            name: 'Δυναμική Προσαρμογή',
            information: 'Κάθε εταιρεία μπορεί να εισάγει τα στοιχεία της, να προσαρμόσει την προσφορά και να δημιουργήσει ένα εξατομικευμένο PDF'
        },
        {
            name: 'Προηγμένη Ανάπτυξη',
            information: 'Με τα Angular Signals, η εφαρμογή προσφέρει δυναμικές ενημερώσεις για τα δεδομένα της φόρμας και τα διαδραστικά στοιχεία'
        },
        {
            name: 'Περιβάλλον Zoneless',
            information: 'Με την υιοθέτηση του "Angular Zoneless", η εφαρμογή εξασφαλίζει βελτιωμένη απόδοση και μειωμένη πολυπλοκότητα'
        },
        {
            name: 'Angular Material & SASS',
            information: 'Το κομψό και ευέλικτο Angular Material σε συνδιασμό με την SASS προσφέρουν έναν καθαρό και μοντέρνο σχεδιασμό'
        },
        {
            name: 'Δημιουργία PDF',
            information: `Ενσωματώνει την βιβλιοθήκη <a class="link" href="https://artskydj.github.io/jsPDF/docs/jsPDF.html" target="_blank">jsPDF</a> 
        για τη δημιουργία αρχείων PDF με σχετικό πίνακα για προϊόντα και τιμές`
        },
        {
            name: 'Πολύγλωσσο',
            information: 'Υποστηρίζει Αγγλικά και Ελληνικά, επιτρέποντας την χρήση σε Έλληνες και διεθνείς χρήστες'
        }
    ],
    customPdfHeader: 'Προσαρμοσμένο PDF',
        contact: [
        `Η εφαρμογή μπορεί να προσαρμοστεί ώστε να επιτρέπει σε μια επιχείρηση να δημιουργεί το δικό της 
        προσαρμοσμένο αρχείο PDF, συμπεριλαμβανομένου του λογότυπου της εταιρείας και οποιουδήποτε άλλου περιεχομένου θέλει να προβάλλει.`,
        `Μη διστάσετε να επικοινωνήσετε μαζί μου
        <a class="link" href="mailto:nick.polizogopoulos@gmail.com?Subject=Σχετικά με προσαρμοσμένη εφαρμογή δημιουργίας PDF">
        εδώ</a>.`,
        `- Νίκος Πολυζωγόπουλος`,
    ],
    buttonText: 'Φτιάξτε το δικό σας .pdf!'
}