import { PrivacyTermsContentType } from "./terms-types";

export const contentGr: PrivacyTermsContentType = {
    pageTitle: 'Πολιτική Απορρήτου & Όροι Χρήσης',
    content: [
        {
            title: 'Πολιτική Απορρήτου',
            date: 'Ημερομηνία Έναρξης Ισχύος: 29η Δεκεμβρίου 2024',
            introductionText: `
                Η εφαρμογή "Product offer to .pdf" σέβεται την ιδιωτικότητά σας και δεσμεύεται να προστατεύει τις προσωπικές σας πληροφορίες. 
                Αυτά είναι όσα πρέπει να γνωρίζετε:`,
            list: [
                {
                    title: 'Συλλογή Δεδομένων',
                    bullet: [
                        'Δεν συλλέγουμε ούτε αποθηκεύουμε δεδομένα χρηστών στους διακομιστές μας.',
                        `Τα στοιχεία της εταιρείας που καταχωρούνται στη φόρμα αποθηκεύονται τοπικά στον περιηγητή σας για ευκολία. 
                        Αυτές οι πληροφορίες δεν κοινοποιούνται ούτε μεταφορτώνονται πουθενά.`
                    ]
                },
                {
                    title: 'Google Analytics',
                    bullet: [
                        `Χρησιμοποιούμε το Google Analytics 4 για την ανάλυση προτύπων χρήσης και τη βελτίωση της εφαρμογής. 
                        Αυτό μπορεί να περιλαμβάνει ανώνυμα δεδομένα, όπως πληροφορίες συσκευής ή στατιστικά χρήσης.`
                    ]
                },
                {
                    title: 'Τα δικαιώματά σας',
                    bullet: [
                        `Δεδομένου ότι δεν συλλέγονται ή αποθηκεύονται προσωπικά δεδομένα στους διακομιστές μας, 
                        δεν απαιτούνται ενέργειες για τη διαγραφή ή πρόσβαση στα δεδομένα σας.`
                    ]
                },
                {
                    title: 'Cookies',
                    bullet: [
                        `Το Google Analytics ενδέχεται να χρησιμοποιεί cookies για την παρακολούθηση χρήσης. 
                        Μπορείτε να διαχειριστείτε τα cookies μέσω των ρυθμίσεων του περιηγητή σας.`
                    ]
                }
            ],
            contact: `Για ερωτήσεις, επικοινωνήστε μαζί μας 
            <a class="link" href="mailto:nick.polizogopoulos@gmail.com?Subject=Σχετικά με την Πολιτική Απορρήτου και Όρους Χρήσης της εφαρμογής Product offer to .pdf">
            εδώ</a>.`
        },
        {
            title: 'Όροι Χρήσης',
            date: 'Ημερομηνία Έναρξης Ισχύος: 29η Δεκεμβρίου 2024',
            introductionText: 'Χρησιμοποιώντας την εφαρμογή "Product offer to .pdf", συμφωνείτε με τους παρακάτω όρους:',
            list: [
                {
                    title: 'Σκοπός της Εφαρμογής',
                    bullet: ['Η εφαρμογή παρέχεται για εταιρείες, ώστε να δημιουργούν προσφορές σε αρχείο PDF για τους πελάτες τους.']
                },
                {
                    title: 'Υποχρεώσεις Χρηστών',
                    bullet: [
                        'Εξασφαλίστε την ακρίβεια των πληροφοριών που καταχωρούνται στη φόρμα.',
                        'Είστε υπεύθυνοι για τη συμμόρφωση με τους ισχύοντες νόμους κατά τη χρήση αυτής της εφαρμογής.',
                    ]
                },
                {
                    title: 'Τοπικός Αποθηκευτικός Χώρος.',
                    bullet: [
                        `Η εφαρμογή αποθηκεύει τα στοιχεία της εταιρείας τοπικά στον περιηγητή σας για ευκολία. 
                        Αυτά τα δεδομένα δεν δημιουργούν αντίγραφα ασφαλείας ούτε είναι ανακτήσιμα αν διαγραφούν.`
                    ]
                },
                {
                    title: 'Χωρίς Εγγυήσεις',
                    bullet: [`Η εφαρμογή παρέχεται "ως έχει" χωρίς καμία εγγύηση ακρίβειας ή αξιοπιστίας.`]
                },
                {
                    title: 'Περιορισμός Ευθύνης',
                    bullet: [
                        `Δεν φέρουμε ευθύνη για οποιαδήποτε προβλήματα προκύψουν από τη χρήση της εφαρμογής, 
                        συμπεριλαμβανομένης της απώλειας δεδομένων ή λαθών στα παραγόμενα PDF.`
                    ]
                }
            ],
            contact: `
                Αν δεν συμφωνείτε με αυτούς τους όρους, παρακαλούμε να διακόψετε τη χρήση της εφαρμογής. 
                Για ερωτήσεις, επικοινωνήστε μαζί μας 
                <a class="link" href="mailto:nick.polizogopoulos@gmail.com?Subject=Σχετικά με την Πολιτική Απορρήτου και Όρους Χρήσης της εφαρμογής Product offer to .pdf">
                εδώ</a>.`
        }
    ],
    buttonText: 'Επιστροφή στην αρχική'
};